betaflight/betaflight/src/platform/STM32/dma_reqmap_mcu.c
static const dmaPeripheralMapping_t dmaPeripheralMapping[] = {
#ifdef USE_SPI
    REQMAP_DIR(SPI, 1, SDO),
    REQMAP_DIR(SPI, 1, SDI),
    REQMAP_DIR(SPI, 2, SDO),
    REQMAP_DIR(SPI, 2, SDI),
    REQMAP_DIR(SPI, 3, SDO),
    REQMAP_DIR(SPI, 3, SDI),
#endif // USE_SPI

#ifdef USE_ADC
    REQMAP(ADC, 1),
    REQMAP(ADC, 2),
#endif

#ifdef USE_UART1
    REQMAP_DIR(UART, 1, TX),
    REQMAP_DIR(UART, 1, RX),
#endif
#ifdef USE_UART2
    REQMAP_DIR(UART, 2, TX),
    REQMAP_DIR(UART, 2, RX),
#endif
#ifdef USE_UART3
    REQMAP_DIR(UART, 3, TX),
    REQMAP_DIR(UART, 3, RX),
#endif
#ifdef USE_UART4
    REQMAP_DIR(UART, 4, TX),
    REQMAP_DIR(UART, 4, RX),
#endif
#ifdef USE_UART5
    REQMAP_DIR(UART, 5, TX),
    REQMAP_DIR(UART, 5, RX),
#endif
#ifdef USE_UART6
    REQMAP_DIR(UART, 6, TX),
    REQMAP_DIR(UART, 6, RX),
#endif
#ifdef USE_UART7
    REQMAP_DIR(UART, 7, TX),
    REQMAP_DIR(UART, 7, RX),
#endif

#ifdef USE_TIMER
// Pseudo peripheral for TIMx_UP channel
    REQMAP_TIMUP(TIMUP, 1),
    REQMAP_TIMUP(TIMUP, 2),
    REQMAP_TIMUP(TIMUP, 3),
    REQMAP_TIMUP(TIMUP, 4),
    REQMAP_TIMUP(TIMUP, 5),
    REQMAP_TIMUP(TIMUP, 6),
    REQMAP_TIMUP(TIMUP, 7),
    REQMAP_TIMUP(TIMUP, 8),
    REQMAP_TIMUP(TIMUP, 15),
    REQMAP_TIMUP(TIMUP, 16),
    REQMAP_TIMUP(TIMUP, 17),
#endif
};

#undef REQMAP_TIMUP
#undef REQMAP
#undef REQMAP_SGL
#undef REQMAP_DIR

#ifdef USE_TIMER
#define TC(chan) DEF_TIM_CHANNEL(CH_ ## chan)

#define REQMAP_TIM(tim, chan) { (timerResource_t *)tim, TC(chan), LL_LPDMA1_REQUEST_ ## tim ## _ ## chan }

static const dmaTimerMapping_t dmaTimerMapping[] = {
    REQMAP_TIM(TIM1, CH1),
    REQMAP_TIM(TIM1, CH2),
    REQMAP_TIM(TIM1, CH3),
    REQMAP_TIM(TIM1, CH4),
    REQMAP_TIM(TIM2, CH1),
    REQMAP_TIM(TIM2, CH2),
    REQMAP_TIM(TIM2, CH3),
    REQMAP_TIM(TIM2, CH4),
    REQMAP_TIM(TIM3, CH1),
    REQMAP_TIM(TIM3, CH2),
    REQMAP_TIM(TIM3, CH3),
    REQMAP_TIM(TIM3, CH4),
    REQMAP_TIM(TIM4, CH1),
    REQMAP_TIM(TIM4, CH2),
    REQMAP_TIM(TIM4, CH3),
    REQMAP_TIM(TIM5, CH1),
    REQMAP_TIM(TIM5, CH2),
    REQMAP_TIM(TIM5, CH3),
    REQMAP_TIM(TIM5, CH4),
    REQMAP_TIM(TIM8, CH1),
    REQMAP_TIM(TIM8, CH2),
    REQMAP_TIM(TIM8, CH3),
    REQMAP_TIM(TIM8, CH4),
    REQMAP_TIM(TIM15, CH1),
    REQMAP_TIM(TIM16, CH1),
    REQMAP_TIM(TIM17, CH1),
};

#undef TC
#undef REQMAP_TIM
#else // !USE_TIMER
static const dmaTimerMapping_t dmaTimerMapping[1] = { { 0 } };
#endif // USE_TIMER

#define DMA1(d, c) { DMA_CODE(d, c, 0), (dmaResource_t *)LPDMA1_CH ## c, 0 }
#define DMA2(d, c) { DMA_CODE(d, c, 0), (dmaResource_t *)LPDMA2_CH ## c, 0 }

static dmaChannelSpec_t dmaChannelSpec[MAX_PERIPHERAL_DMA_OPTIONS] = {
    DMA1(1, 0),
    DMA1(1, 1),
    DMA1(1, 2),
    DMA1(1, 3),
    DMA1(1, 4),
    DMA1(1, 5),
    DMA1(1, 6),
    DMA1(1, 7),
    DMA2(2, 0),
    DMA2(2, 1),
    DMA2(2, 2),
    DMA2(2, 3),
    DMA2(2, 4),
    DMA2(2, 5),
    DMA2(2, 6),
    DMA2(2, 7),
};

#undef DMA1
#undef DMA2

#elif defined(STM32N6)

#define REQMAP_SGL(periph) { DMA_PERIPH_ ## periph, 0, GPDMA1_REQUEST_ ## periph }
#define REQMAP(periph, device) { DMA_PERIPH_ ## periph, periph ## DEV_ ## device, GPDMA1_REQUEST_ ## periph ## device }
#define REQMAP_DIR(periph, device, dir) { DMA_PERIPH_ ## periph ## _ ## dir, periph ## DEV_ ## device, GPDMA1_REQUEST_ ## periph ## device ## _ ## dir }
#define REQMAP_TIMUP(periph, timno) { DMA_PERIPH_TIMUP, TIMER_INDEX(timno), GPDMA1_REQUEST_ ## TIM ## timno ## _UP }

// Resolve UART/USART naming
#define GPDMA1_REQUEST_UART1_RX GPDMA1_REQUEST_USART1_RX
#define GPDMA1_REQUEST_UART1_TX GPDMA1_REQUEST_USART1_TX
#define GPDMA1_REQUEST_UART2_RX GPDMA1_REQUEST_USART2_RX
#define GPDMA1_REQUEST_UART2_TX GPDMA1_REQUEST_USART2_TX
#define GPDMA1_REQUEST_UART3_RX GPDMA1_REQUEST_USART3_RX
#define GPDMA1_REQUEST_UART3_TX GPDMA1_REQUEST_USART3_TX
#define GPDMA1_REQUEST_UART6_RX GPDMA1_REQUEST_USART6_RX
#define GPDMA1_REQUEST_UART6_TX GPDMA1_REQUEST_USART6_TX
#define GPDMA1_REQUEST_UART10_RX GPDMA1_REQUEST_USART10_RX
#define GPDMA1_REQUEST_UART10_TX GPDMA1_REQUEST_USART10_TX

// Resolve SPI SDO/SDI naming
#define GPDMA1_REQUEST_SPI1_SDO GPDMA1_REQUEST_SPI1_TX
#define GPDMA1_REQUEST_SPI1_SDI GPDMA1_REQUEST_SPI1_RX
#define GPDMA1_REQUEST_SPI2_SDO GPDMA1_REQUEST_SPI2_TX
#define GPDMA1_REQUEST_SPI2_SDI GPDMA1_REQUEST_SPI2_RX
#define GPDMA1_REQUEST_SPI3_SDO GPDMA1_REQUEST_SPI3_TX
#define GPDMA1_REQUEST_SPI3_SDI GPDMA1_REQUEST_SPI3_RX
#define GPDMA1_REQUEST_SPI4_SDO GPDMA1_REQUEST_SPI4_TX
#define GPDMA1_REQUEST_SPI4_SDI GPDMA1_REQUEST_SPI4_RX
#define GPDMA1_REQUEST_SPI5_SDO GPDMA1_REQUEST_SPI5_TX
#define GPDMA1_REQUEST_SPI5_SDI GPDMA1_REQUEST_SPI5_RX

static const dmaPeripheralMapping_t dmaPeripheralMapping[] = {
#ifdef USE_SPI
    REQMAP_DIR(SPI, 1, SDO),
    REQMAP_DIR(SPI, 1, SDI),
    REQMAP_DIR(SPI, 2, SDO),
    REQMAP_DIR(SPI, 2, SDI),
    REQMAP_DIR(SPI, 3, SDO),
    REQMAP_DIR(SPI, 3, SDI),
    REQMAP_DIR(SPI, 4, SDO),
    REQMAP_DIR(SPI, 4, SDI),
    REQMAP_DIR(SPI, 5, SDO),
    REQMAP_DIR(SPI, 5, SDI),
#endif

#ifdef USE_ADC
    REQMAP(ADC, 1),
    REQMAP(ADC, 2),
#endif

#ifdef USE_UART1
    REQMAP_DIR(UART, 1, TX),
    REQMAP_DIR(UART, 1, RX),
#endif
#ifdef USE_UART2
    REQMAP_DIR(UART, 2, TX),
    REQMAP_DIR(UART, 2, RX),
#endif
#ifdef USE_UART3
    REQMAP_DIR(UART, 3, TX),
    REQMAP_DIR(UART, 3, RX),
#endif
#ifdef USE_UART4
    REQMAP_DIR(UART, 4, TX),
    REQMAP_DIR(UART, 4, RX),
#endif
#ifdef USE_UART5
    REQMAP_DIR(UART, 5, TX),
    REQMAP_DIR(UART, 5, RX),
#endif
#ifdef USE_UART6
    REQMAP_DIR(UART, 6, TX),
    REQMAP_DIR(UART, 6, RX),
#endif
#ifdef USE_UART7
    REQMAP_DIR(UART, 7, TX),
    REQMAP_DIR(UART, 7, RX),
#endif
#ifdef USE_UART8
    REQMAP_DIR(UART, 8, TX),
    REQMAP_DIR(UART, 8, RX),
#endif
#ifdef USE_UART9
    REQMAP_DIR(UART, 9, TX),
    REQMAP_DIR(UART, 9, RX),
#endif
#ifdef USE_UART10
    REQMAP_DIR(UART, 10, TX),
    REQMAP_DIR(UART, 10, RX),
#endif

#ifdef USE_TIMER
    REQMAP_TIMUP(TIMUP, 1),
    REQMAP_TIMUP(TIMUP, 2),
    REQMAP_TIMUP(TIMUP, 3),
    REQMAP_TIMUP(TIMUP, 4),
    REQMAP_TIMUP(TIMUP, 5),
    REQMAP_TIMUP(TIMUP, 6),
    REQMAP_TIMUP(TIMUP, 7),
    REQMAP_TIMUP(TIMUP, 8),
    REQMAP_TIMUP(TIMUP, 15),
    REQMAP_TIMUP(TIMUP, 16),
    REQMAP_TIMUP(TIMUP, 17),
#endif
};

#undef REQMAP_TIMUP
#undef REQMAP
#undef REQMAP_SGL
#undef REQMAP_DIR

#define TC(chan) DEF_TIM_CHANNEL(CH_ ## chan)

